; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-4 - location
	p0-6 - location
	p0-12 - location
	p1-5 - location
	p2-3 - location
	p2-6 - location
	p2-10 - location
	p3-5 - location
	p3-6 - location
	p3-7 - location
	p3-10 - location
	p4-1 - location
	p4-9 - location
	p4-10 - location
	p5-0 - location
	p5-8 - location
	p5-9 - location
	p5-11 - location
	p9-1 - location
	p9-2 - location
	p10-0 - location
	p11-1 - location
	p12-9 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s11)
	(at driver3 s2)
	(at truck1 s9)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s7)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s6)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s1)
	(at package2 s10)
	(at package3 s3)
	(at package4 s2)
	(at package5 s11)
	(at package6 s1)
	(at package7 s5)
	(at package8 s9)
	(at package9 s3)
	(at package10 s11)
	(at package11 s2)
	(at package12 s12)
	(at package13 s9)
	(at package14 s3)
	(at package15 s1)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s0 p0-12)
	(path p0-12 s0)
	(path s12 p0-12)
	(path p0-12 s12)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-10)
	(path p2-10 s2)
	(path s10 p2-10)
	(path p2-10 s10)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(path s5 p5-11)
	(path p5-11 s5)
	(path s11 p5-11)
	(path p5-11 s11)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(path s12 p12-9)
	(path p12-9 s12)
	(path s9 p12-9)
	(path p12-9 s9)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 87)
	(= (time-to-drive s8 s0) 87)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 96)
	(= (time-to-drive s9 s0) 96)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 95)
	(= (time-to-drive s11 s0) 95)
	(link s0 s12)
	(link s12 s0)
	(= (time-to-drive s0 s12) 79)
	(= (time-to-drive s12 s0) 79)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 19)
	(= (time-to-drive s0 s1) 19)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 54)
	(= (time-to-drive s7 s1) 54)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 13)
	(= (time-to-drive s1 s2) 13)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 16)
	(= (time-to-drive s4 s2) 16)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 71)
	(= (time-to-drive s0 s3) 71)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 82)
	(= (time-to-drive s9 s3) 82)
	(link s3 s12)
	(link s12 s3)
	(= (time-to-drive s3 s12) 43)
	(= (time-to-drive s12 s3) 43)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 67)
	(= (time-to-drive s1 s4) 67)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 34)
	(= (time-to-drive s3 s4) 34)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 85)
	(= (time-to-drive s5 s4) 85)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 29)
	(= (time-to-drive s6 s4) 29)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 8)
	(= (time-to-drive s10 s4) 8)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 10)
	(= (time-to-drive s9 s5) 10)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 67)
	(= (time-to-drive s8 s6) 67)
	(link s6 s9)
	(link s9 s6)
	(= (time-to-drive s6 s9) 62)
	(= (time-to-drive s9 s6) 62)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 60)
	(= (time-to-drive s6 s7) 60)
	(link s7 s10)
	(link s10 s7)
	(= (time-to-drive s7 s10) 25)
	(= (time-to-drive s10 s7) 25)
	(link s8 s2)
	(link s2 s8)
	(= (time-to-drive s8 s2) 24)
	(= (time-to-drive s2 s8) 24)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 20)
	(= (time-to-drive s7 s8) 20)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 73)
	(= (time-to-drive s7 s9) 73)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 82)
	(= (time-to-drive s8 s9) 82)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 62)
	(= (time-to-drive s2 s10) 62)
	(link s10 s3)
	(link s3 s10)
	(= (time-to-drive s10 s3) 38)
	(= (time-to-drive s3 s10) 38)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 75)
	(= (time-to-drive s5 s10) 75)
	(link s10 s11)
	(link s11 s10)
	(= (time-to-drive s10 s11) 74)
	(= (time-to-drive s11 s10) 74)
	(link s11 s1)
	(link s1 s11)
	(= (time-to-drive s11 s1) 8)
	(= (time-to-drive s1 s11) 8)
	(link s11 s7)
	(link s7 s11)
	(= (time-to-drive s11 s7) 44)
	(= (time-to-drive s7 s11) 44)
	(link s11 s9)
	(link s9 s11)
	(= (time-to-drive s11 s9) 60)
	(= (time-to-drive s9 s11) 60)
	(link s12 s1)
	(link s1 s12)
	(= (time-to-drive s12 s1) 3)
	(= (time-to-drive s1 s12) 3)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 39)
	(= (time-to-drive s4 s12) 39)
	(link s12 s6)
	(link s6 s12)
	(= (time-to-drive s12 s6) 39)
	(= (time-to-drive s6 s12) 39)
	(link s12 s9)
	(link s9 s12)
	(= (time-to-drive s12 s9) 22)
	(= (time-to-drive s9 s12) 22)
	(link s12 s10)
	(link s10 s12)
	(= (time-to-drive s12 s10) 93)
	(= (time-to-drive s10 s12) 93)
	(link s12 s11)
	(link s11 s12)
	(= (time-to-drive s12 s11) 52)
	(= (time-to-drive s11 s12) 52)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s3)
	(at driver3 s9)
	(at truck2 s11)
	(at truck3 s2)
	(at truck4 s1)
	(at package1 s1)
	(at package2 s3)
	(at package3 s12)
	(at package4 s6)
	(at package5 s4)
	(at package6 s7)
	(at package7 s3)
	(at package8 s11)
	(at package9 s5)
	(at package11 s6)
	(at package12 s4)
	(at package13 s7)
	(at package14 s10)
	(at package15 s8)
	))

(:metric minimize (+ (* 2 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver3 s2 p2-6)
   deleted: (at driver3 s2)
   added: (at driver3 p2-6)
   goals met: 1 of 19
2. (board-truck driver1 truck2 s7)
   deleted: (at driver1 s7) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 1 of 19
3. (drive-truck truck2 s7 s11 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s11)
   changed: (fuel-used) from 0 to 440
   goals met: 2 of 19
4. (walk driver3 p2-6 s6)
   deleted: (at driver3 p2-6)
   added: (at driver3 s6)
   goals met: 2 of 19
5. (load-truck package5 truck2 s11)
   deleted: (at package5 s11)
   added: (in package5 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 19
6. (drive-truck truck2 s11 s9 driver1)
   deleted: (at truck2 s11)
   added: (at truck2 s9)
   changed: (fuel-used) from 440 to 1100
   goals met: 1 of 19
7. (load-truck package13 truck2 s9)
   deleted: (at package13 s9)
   added: (in package13 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 1 of 19
8. (load-truck package8 truck2 s9)
   deleted: (at package8 s9)
   added: (in package8 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 1 of 19
9. (drive-truck truck2 s9 s11 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s11)
   changed: (fuel-used) from 1100 to 2060
   goals met: 2 of 19
10. (unload-truck package8 truck2 s11)
   deleted: (in package8 truck2)
   added: (at package8 s11)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 3 of 19
11. (drive-truck truck2 s11 s10 driver1)
   deleted: (at truck2 s11)
   added: (at truck2 s10)
   changed: (fuel-used) from 2060 to 3022
   goals met: 2 of 19
12. (load-truck package2 truck2 s10)
   deleted: (at package2 s10)
   added: (in package2 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 2 of 19
13. (drive-truck truck2 s10 s11 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s11)
   changed: (fuel-used) from 3022 to 4206
   goals met: 3 of 19
14. (drive-truck truck2 s11 s1 driver1)
   deleted: (at truck2 s11)
   added: (at truck2 s1)
   changed: (fuel-used) from 4206 to 4334
   goals met: 2 of 19
15. (load-truck package6 truck2 s1)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 2 of 19
16. (load-truck package15 truck2 s1)
   deleted: (at package15 s1)
   added: (in package15 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 2 of 19
17. (drive-truck truck2 s1 s11 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s11)
   changed: (fuel-used) from 4334 to 4534
   goals met: 3 of 19
18. (drive-truck truck2 s11 s10 driver1)
   deleted: (at truck2 s11)
   added: (at truck2 s10)
   changed: (fuel-used) from 4534 to 6384
   goals met: 2 of 19
19. (walk driver3 s6 p0-6)
   deleted: (at driver3 s6)
   added: (at driver3 p0-6)
   goals met: 2 of 19
20. (walk driver3 p0-6 s0)
   deleted: (at driver3 p0-6)
   added: (at driver3 s0)
   goals met: 2 of 19
21. (drive-truck truck2 s10 s4 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s4)
   changed: (fuel-used) from 6384 to 6584
   goals met: 2 of 19
22. (unload-truck package5 truck2 s4)
   deleted: (in package5 truck2)
   added: (at package5 s4)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 3 of 19
23. (drive-truck truck2 s4 s10 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s10)
   changed: (fuel-used) from 6584 to 6744
   goals met: 3 of 19
24. (walk driver3 s0 p0-6)
   deleted: (at driver3 s0)
   added: (at driver3 p0-6)
   goals met: 3 of 19
25. (walk driver3 p0-6 s6)
   deleted: (at driver3 p0-6)
   added: (at driver3 s6)
   goals met: 3 of 19
26. (drive-truck truck2 s10 s3 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s3)
   changed: (fuel-used) from 6744 to 7504
   goals met: 3 of 19
27. (load-truck package3 truck2 s3)
   deleted: (at package3 s3)
   added: (in package3 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 3 of 19
28. (unload-truck package2 truck2 s3)
   deleted: (in package2 truck2)
   added: (at package2 s3)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 4 of 19
29. (load-truck package9 truck2 s3)
   deleted: (at package9 s3)
   added: (in package9 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 4 of 19
30. (load-truck package14 truck2 s3)
   deleted: (at package14 s3)
   added: (in package14 truck2)
   changed: (load truck2) from 5 to 6, (fuel-per-minute truck2) from 25 to 31
   goals met: 4 of 19
31. (board-truck driver3 truck3 s6)
   deleted: (at driver3 s6) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 4 of 19
32. (drive-truck truck2 s3 s10 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s10)
   changed: (fuel-used) from 7504 to 8682
   goals met: 4 of 19
33. (drive-truck truck3 s6 s8 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s8)
   changed: (fuel-used) from 8682 to 9352
   goals met: 4 of 19
34. (unload-truck package14 truck2 s10)
   deleted: (in package14 truck2)
   added: (at package14 s10)
   changed: (load truck2) from 6 to 5, (fuel-per-minute truck2) from 31 to 25
   goals met: 5 of 19
35. (drive-truck truck2 s10 s12 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s12)
   changed: (fuel-used) from 9352 to 11677
   goals met: 5 of 19
36. (unload-truck package3 truck2 s12)
   deleted: (in package3 truck2)
   added: (at package3 s12)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 6 of 19
37. (load-truck package12 truck2 s12)
   deleted: (at package12 s12)
   added: (in package12 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 6 of 19
38. (drive-truck truck3 s8 s2 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s2)
   changed: (fuel-used) from 11677 to 11917
   goals met: 7 of 19
39. (load-truck package11 truck3 s2)
   deleted: (at package11 s2)
   added: (in package11 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 7 of 19
40. (drive-truck truck2 s12 s3 driver1)
   deleted: (at truck2 s12)
   added: (at truck2 s3)
   changed: (fuel-used) from 11917 to 12992
   goals met: 7 of 19
41. (load-truck package4 truck3 s2)
   deleted: (at package4 s2)
   added: (in package4 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 7 of 19
42. (drive-truck truck3 s2 s8 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s8)
   changed: (fuel-used) from 12992 to 13304
   goals met: 6 of 19
43. (drive-truck truck3 s8 s6 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   changed: (fuel-used) from 13304 to 14175
   goals met: 6 of 19
44. (unload-truck package11 truck3 s6)
   deleted: (in package11 truck3)
   added: (at package11 s6)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 7 of 19
45. (unload-truck package4 truck3 s6)
   deleted: (in package4 truck3)
   added: (at package4 s6)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 19
46. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 14175 to 15950
   goals met: 8 of 19
47. (drive-truck truck2 s0 s11 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s11)
   changed: (fuel-used) from 15950 to 18325
   goals met: 9 of 19
48. (drive-truck truck2 s11 s10 driver1)
   deleted: (at truck2 s11)
   added: (at truck2 s10)
   changed: (fuel-used) from 18325 to 20175
   goals met: 8 of 19
49. (drive-truck truck3 s6 s9 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s9)
   changed: (fuel-used) from 20175 to 20795
   goals met: 8 of 19
50. (disembark-truck driver3 truck3 s9)
   deleted: (driving driver3 truck3)
   added: (at driver3 s9) (empty truck3)
   goals met: 9 of 19
51. (drive-truck truck2 s10 s4 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s4)
   changed: (fuel-used) from 20795 to 20995
   goals met: 9 of 19
52. (unload-truck package12 truck2 s4)
   deleted: (in package12 truck2)
   added: (at package12 s4)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 10 of 19
53. (drive-truck truck2 s4 s3 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (fuel-used) from 20995 to 21675
   goals met: 10 of 19
54. (drive-truck truck2 s3 s9 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s9)
   changed: (fuel-used) from 21675 to 23315
   goals met: 10 of 19
55. (board-truck driver3 truck3 s9)
   deleted: (at driver3 s9) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 9 of 19
56. (drive-truck truck3 s9 s8 driver3)
   deleted: (at truck3 s9)
   added: (at truck3 s8)
   changed: (fuel-used) from 23315 to 24135
   goals met: 9 of 19
57. (drive-truck truck3 s8 s2 driver3)
   deleted: (at truck3 s8)
   added: (at truck3 s2)
   changed: (fuel-used) from 24135 to 24375
   goals met: 10 of 19
58. (disembark-truck driver3 truck3 s2)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 10 of 19
59. (walk driver3 s2 p9-2)
   deleted: (at driver3 s2)
   added: (at driver3 p9-2)
   goals met: 10 of 19
60. (drive-truck truck2 s9 s8 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s8)
   changed: (fuel-used) from 24375 to 26015
   goals met: 10 of 19
61. (unload-truck package15 truck2 s8)
   deleted: (in package15 truck2)
   added: (at package15 s8)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 11 of 19
62. (drive-truck truck2 s8 s9 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s9)
   changed: (fuel-used) from 26015 to 27327
   goals met: 11 of 19
63. (walk driver3 p9-2 s9)
   deleted: (at driver3 p9-2)
   added: (at driver3 s9)
   goals met: 12 of 19
64. (drive-truck truck2 s9 s5 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s5)
   changed: (fuel-used) from 27327 to 27487
   goals met: 12 of 19
65. (unload-truck package9 truck2 s5)
   deleted: (in package9 truck2)
   added: (at package9 s5)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 13 of 19
66. (load-truck package7 truck2 s5)
   deleted: (at package7 s5)
   added: (in package7 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 13 of 19
67. (drive-truck truck2 s5 s10 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s10)
   changed: (fuel-used) from 27487 to 28687
   goals met: 13 of 19
68. (drive-truck truck2 s10 s3 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s3)
   changed: (fuel-used) from 28687 to 29295
   goals met: 13 of 19
69. (unload-truck package7 truck2 s3)
   deleted: (in package7 truck2)
   added: (at package7 s3)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 14 of 19
70. (drive-truck truck2 s3 s9 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s9)
   changed: (fuel-used) from 29295 to 30361
   goals met: 14 of 19
71. (drive-truck truck2 s9 s7 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s7)
   changed: (fuel-used) from 30361 to 31310
   goals met: 14 of 19
72. (disembark-truck driver1 truck2 s7)
   deleted: (driving driver1 truck2)
   added: (at driver1 s7) (empty truck2)
   goals met: 14 of 19
73. (unload-truck package6 truck2 s7)
   deleted: (in package6 truck2)
   added: (at package6 s7)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 15 of 19
74. (unload-truck package13 truck2 s7)
   deleted: (in package13 truck2)
   added: (at package13 s7)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 16 of 19
75. (board-truck driver3 truck1 s9)
   deleted: (at driver3 s9) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 15 of 19
76. (board-truck driver1 truck2 s7)
   deleted: (at driver1 s7) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 15 of 19
77. (drive-truck truck1 s9 s0 driver3)
   deleted: (at truck1 s9)
   added: (at truck1 s0)
   changed: (fuel-used) from 31310 to 32270
   goals met: 15 of 19
78. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 15 of 19
79. (board-truck driver3 truck4 s0)
   deleted: (at driver3 s0) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 15 of 19
80. (drive-truck truck2 s7 s11 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s11)
   changed: (fuel-used) from 32270 to 32710
   goals met: 16 of 19
81. (drive-truck truck4 s0 s9 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s9)
   changed: (fuel-used) from 32710 to 33670
   goals met: 16 of 19
82. (disembark-truck driver1 truck2 s11)
   deleted: (driving driver1 truck2)
   added: (at driver1 s11) (empty truck2)
   goals met: 16 of 19
83. (disembark-truck driver3 truck4 s9)
   deleted: (driving driver3 truck4)
   added: (at driver3 s9) (empty truck4)
   goals met: 17 of 19
84. (walk driver1 s11 p5-11)
   deleted: (at driver1 s11)
   added: (at driver1 p5-11)
   goals met: 17 of 19
85. (walk driver1 p5-11 s5)
   deleted: (at driver1 p5-11)
   added: (at driver1 s5)
   goals met: 17 of 19
86. (walk driver1 s5 p3-5)
   deleted: (at driver1 s5)
   added: (at driver1 p3-5)
   goals met: 17 of 19
87. (board-truck driver3 truck4 s9)
   deleted: (at driver3 s9) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 16 of 19
88. (drive-truck truck4 s9 s0 driver3)
   deleted: (at truck4 s9)
   added: (at truck4 s0)
   changed: (fuel-used) from 33670 to 34630
   goals met: 16 of 19
89. (drive-truck truck4 s0 s1 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (fuel-used) from 34630 to 34820
   goals met: 17 of 19
90. (disembark-truck driver3 truck4 s1)
   deleted: (driving driver3 truck4)
   added: (at driver3 s1) (empty truck4)
   goals met: 17 of 19
91. (walk driver1 p3-5 s3)
   deleted: (at driver1 p3-5)
   added: (at driver1 s3)
   goals met: 18 of 19
92. (walk driver3 s1 p9-1)
   deleted: (at driver3 s1)
   added: (at driver3 p9-1)
   goals met: 18 of 19
93. (walk driver3 p9-1 s9)
   deleted: (at driver3 p9-1)
   added: (at driver3 s9)
   goals met: 19 of 19
